In [2]:
import sqlite3

conn = sqlite3.connect('mydatabase.db')

In [7]:
conn = sqlite3.connect('mydatabase.db')

cursor  = conn.cursor()

sql ='''CREATE TABLE transactions(
   ID UUID,
   insert_time TIMESTAMP,
   tx_amount FLOAT,
   tx_type CHARACTER(20),
   status CHARACTER(20)
)'''

cursor.execute(sql)
print("Table created successfully........")

conn.commit()

Table created successfully........

In [8]:
cursor.execute('''INSERT INTO transactions(
   ID, insert_time, tx_amount, tx_type, status) VALUES 
   (1, 24062021, 27, 'buy', 'open')''')

cursor.execute('''INSERT INTO transactions(
   ID, insert_time, tx_amount, tx_type, status) VALUES 
   (2, 24062021, 20, 'buy', 'open')''')

cursor.execute('''INSERT INTO transactions(
   ID, insert_time, tx_amount, tx_type, status) VALUES 
   (3, 25062021, 25, 'buy', 'open')''')

cursor.execute('''INSERT INTO transactions(
   ID, insert_time, tx_amount, tx_type, status) VALUES 
   (4, 25062021, 26, 'buy', 'open')''')

cursor.execute('''INSERT INTO transactions(
   ID, insert_time, tx_amount, tx_type, status) VALUES 
   (5, 26062021, 24, 'buy', 'open')''')

cursor.execute('''SELECT * from transactions''')
result = cursor.fetchall();
print(result)

[(1, 24062021, 27.0, 'buy', 'open'), (2, 24062021, 20.0, 'buy', 'open'), (3, 25062021, 25.0, 'buy', 'open'), (4, 25062021, 26.0, 'buy', 'open'), (5, 26062021, 24.0, 'buy', 'open')]

In [15]:
conn = sqlite3.connect('mydatabase.db')

cursor  = conn.cursor()

sql = """CREATE TABLE IF NOT EXISTS
datasetB(Date TIMESTAMP, Sales INTEGER)"""

cursor.execute(sql)

cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('01/01/21',100)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('02/01/21',34)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('02/01/21',123)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('02/01/21',132)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('03/01/21',145)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('03/01/21',24)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('04/01/21',541)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('04/01/21',636)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('05/01/21',322)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('06/01/21',242)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('07/01/21',22)")
cursor.execute("INSERT INTO datasetB (Date, Sales) VALUES ('08/01/21',46)")

cursor.execute("""SELECT DISTINCT(Date), SUM(Sales) OVER(PARTITION BY Date) 
                      FROM datasetB""")

for result in cursor.fetchall():
    print(result)

('01/01/21', 100)
('02/01/21', 289)
('03/01/21', 169)
('04/01/21', 1177)
('05/01/21', 322)
('06/01/21', 242)
('07/01/21', 22)
('08/01/21', 46)

In [16]:
import pandas as pd
import json

In [29]:
datasetB = [
   {
       "user": {
           "id": 1,
           "name": "agus",
           "email": "agus@example.com"
       },
       "txs": [
           {
               "id": 1,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 3,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 5,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "sell"
           }
       ]
   },
   {
       "user": {
           "id": 2,
           "name": "asep",
           "email": "asep@example.com"
       },
       "txs": [
           {
               "id": 2,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 4,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 6,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "buy"
           }
       ]
   }
]

In [30]:
datasetB

[{'user': {'id': 1, 'name': 'agus', 'email': 'agus@example.com'},
  'txs': [{'id': 1,
    'tx_date': '2020-01-01',
    'tx_amount': 10,
    'tx_type': 'buy'},
   {'id': 3, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'buy'},
   {'id': 5, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'sell'}]},
 {'user': {'id': 2, 'name': 'asep', 'email': 'asep@example.com'},
  'txs': [{'id': 2,
    'tx_date': '2020-01-01',
    'tx_amount': 10,
    'tx_type': 'sell'},
   {'id': 4, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'sell'},
   {'id': 6, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'buy'}]}]

In [31]:
with open('datasetB.json', 'w') as files:
    json.dump(datasetB,files)

In [32]:
datasetB

[{'user': {'id': 1, 'name': 'agus', 'email': 'agus@example.com'},
  'txs': [{'id': 1,
    'tx_date': '2020-01-01',
    'tx_amount': 10,
    'tx_type': 'buy'},
   {'id': 3, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'buy'},
   {'id': 5, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'sell'}]},
 {'user': {'id': 2, 'name': 'asep', 'email': 'asep@example.com'},
  'txs': [{'id': 2,
    'tx_date': '2020-01-01',
    'tx_amount': 10,
    'tx_type': 'sell'},
   {'id': 4, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'sell'},
   {'id': 6, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'buy'}]}]

In [34]:
data = pd.json_normalize(datasetB, 'txs', [['user','id'], ['user','name'], ['user','email']])
data

   id     tx_date  tx_amount tx_type user.id user.name        user.email
0   1  2020-01-01         10     buy       1      agus  agus@example.com
1   3  2020-02-01         10     buy       1      agus  agus@example.com
2   5  2020-03-01         20    sell       1      agus  agus@example.com
3   2  2020-01-01         10    sell       2      asep  asep@example.com
4   4  2020-02-01         10    sell       2      asep  asep@example.com
5   6  2020-03-01         20     buy       2      asep  asep@example.com

In [36]:
csv_1 = data[['id',"user.id"]]
csv_1

   id user.id
0   1       1
1   3       1
2   5       1
3   2       2
4   4       2
5   6       2

In [40]:
csv_1.to_csv('CSV_1.csv', header= ['user_id', 'tx_id'],index= False)

In [46]:
csv_2 = data[['user.id','user.name','user.email']].drop_duplicates()
csv_2

  user.id user.name        user.email
0       1      agus  agus@example.com
3       2      asep  asep@example.com

In [49]:
csv_2.to_csv('CSV_2.csv', header= ['id', 'name', 'email'], index= False)

In [50]:
csv_3 = data[['id','tx_date','tx_amount','tx_type']]
csv_3

   id     tx_date  tx_amount tx_type
0   1  2020-01-01         10     buy
1   3  2020-02-01         10     buy
2   5  2020-03-01         20    sell
3   2  2020-01-01         10    sell
4   4  2020-02-01         10    sell
5   6  2020-03-01         20     buy

In [51]:
csv_3.to_csv('CSV_3.csv', header = ['id','tx_date','tx_amount','tx_type'], index=False)